const data = {
    title: {
        h1: "国画口诀术语备忘录",
        p: "汇集国画口诀术语，助力理论技艺提升"
    },
    head: {
        title: "国画口诀术语备忘录",
        keywords: "国画口诀, 调色口诀, 花鸟画口诀, 山水口诀, 人物口诀, 点皱画法口诀",
        description: "本备忘录汇总了国画调色、花鸟画、山水、人物、点皱画法、画树及构图等方面的口诀，为国画学习者提供实用指导。"
    },
    keywords: ["国画口诀", "调色", "花鸟画", "山水画", "人物画"],
    content: {
        "🎨调色|🎨 精准调色，绘就多彩国画": [
            "<c><p>灰绿色是三绿＋墨。</p><p>绛红色是胭脂＋朱膘＋墨。</p><p>老绿色是草绿＋胭脂。</p><p>墨青色是花青＋墨。</p><p>墨绿色是草绿＋墨。</p><p>褐色是赭石＋墨。</p><p>蓝灰色是花青＋白粉＋三青。</p><p>檀香色是藤黄＋朱膘＋三绿。</p><p>胭脂水是胭脂＋水。</p><p>朱红色是朱膘＋曙红。</p><p>粉黄色是藤黄＋白色</p><p>土红色是朱膘＋胭脂。</p></c>"
        ],
        "🐦花鸟|🐦 写意花鸟，追求生动意趣": [
            "<c><p>大胆落笔画写意，追求生动与意趣。</p><p>似而不似有味道，画象并非是目的。</p></c>",
            "<c><p>研究结构很必要，求变还需找规律。</p><p>笔墨效果关系大，生动美感于表里。</p></c>",
            "<c><p>重点突破要循序，持之以恒达目的。</p><p>有宾有主须分明，大都主体墨色浓。</p></c>",
            "<c><p>形体不同相衬托，主角多在大虚空。</p><p>贯通画幅要取势，主势辅势分量重。</p></c>",
            "<c><p>相破逆势不可少，配合主题多空灵。</p><p>找出规律自有法，三点三线三角形。</p></c>",
            "<c><p>打破呆板与对称，参差错落求生动。</p><p>不必完整有美感，齐而不齐变化中。</p></c>",
            "<c><p>密不透风疏跑马，疏中有密密中疏。</p><p>还应注意留气眼，画得丰富也灵动。</p></c>",
            "<c><p>伸出引入是画理，画处有画意境生。</p></c>"
        ],
        "⛰️山水|⛰️ 描绘山水，展现自然神韵": [
            "<c><p>山为勾皱点，树为彩墨染。</p><p>画前需定形，先从树起跟。</p></c>",
            "<c><p>勾出树枝干，稍点树梢墨。</p><p>颜色要细调，红绿要纯清。</p></c>",
            "<c><p>染在树梢顶，树头浓墨分。</p><p>松要摆大气，枝干壮山魂。</p></c>",
            "<c><p>近松叶要明，远松稍点清。</p><p>叶用深绿染，干要株黄清。</p></c>",
            "<c><p>杂树枝要细，点叶要分明。</p><p>不可太浓厚，不要太稀勻。</p></c>",
            "<c><p>山涧多树长，层次要分明。</p><p>大小照远近，浓淡要看形。</p></c>",
            "<c><p>山石虽大气，莫忘暗与明。</p><p>有光一方照，此方须淡澄。</p></c>",
            "<c><p>无光一方照，明暗下笔沉。</p><p>画好一磅石，远近多关心。</p></c>",
            "<c><p>与树相连处，层次要高明。</p></c>"
        ],
        "👤人物|👤 刻画人物，凸显性格特征": [
            "<c><p><h4>魔鬼样：头如牛、眉如帚、称砣鼻子火喷口，铃铛眼、核桃脸（起皱不平），锯齿燎牙带耳环，胞臂腿壮生筋腱，袒胸露腹衣不全。</p></c>",
            "<c><p><h4>老者</h4>抬肩、曲背、呆容、硬膝、转身慢、步平、手战（颤）、起迟、立歌、支杖、头摇摇点点。</p></c>",
            "<c><p><h4>少者</h4>耳容、佻达、风流、身如弓、行步俏、双袖垂、两眼转。</p></c>",
            "<c><p><h4>站立者</h4>舒眉、凝眉、正容、恭袖。</p></c>",
            "<c><p><h4>武者</h4>威容、眉锁皱、挺胸脯、腰劲直、步阔，侧立不可立、肘曲如抱月，手作推舟势。</p></c>",
            "<c><p><h4>贫者</h4>愁容、锁眉、穷袖、腐肘、摩腕、搔鬓、缩头、耸肩、套手、擦涕、端正步酸子气、低视。</p></c>",
            "<c><p><h4>富者</h4>欢容、捻指、昂头、仰面、舒眉、抹鼻、拍胸、撑手、圈指。</p></c>",
            "<c><p><h4>癫者</h4>定眼、呆视、目直、斜步、手摇、头僵、胸露、身侧。</p></c>",
            "<c><p><h4>醉者</h4>呆容、模糊眼、目倦、步跑、手欲扶、口欲吐、身摇、头垂、坐斜、浑身呈软状、独脚梗硬。</p></c>",
            "<c><p><h4>画头面</h4><p>“先观八格、次看三庭，眼横五配、口约三句、明期大局、好定方寸”。<p></p>八格又称“八字格”即人的头像外型有田、由、国、用、目、甲、风、申字形；<p></p>三庭指发际至印堂为上庭、印堂至鼻准为中庭、鼻准至地庭为下庭，或称“三停”也可；<p></p>五配又称五部或五眼，即是指山根约一眼之位，两鱼尾约两眼之位，双目占两眼之位。</p></c>"
        ],
        "✍️点皱|✍️ 点皱技法，增添画面质感": [
            "<c><h4>勾</h4><p>执笔略倾力在腕，中侧结合须自然。</p><p>起行收笔要果断，墨有浓淡可略干。</p><p>慢行涩进送到位，有实有虚有断连。</p><p>要按结构来勾线，前后大小分层面。</p></c>",
            "<c><h4>皱</h4><p>山水皱法是关键，分为三类点线面。</p><p>皱的部位很重要，阴凹纹理后石面。</p><p>皱笔果断莫重复，保留笔触不可乱。</p><p>深入刻画求厚重，一遍不可可数遍。</p></c>",
            "<c><h4>擦</h4><p>皱纹不足擦笔添，增加厚重粗糙感。</p><p>擦笔要干轻触纸，不可破坏纹理线。</p><p>由轻而重莫过分，一遍不足可数遍。</p><p>山石质地有不同，皱擦可以不增减。</p></c>",
            "<c><h4>点</h4><p>最后用墨点苔点，如同山水长眉眼。</p><p>横点竖点尖与圆，用笔触纸莫迟缓。</p><p>根据山形来选择，笔法一致有聚散。</p><p>前后上下有虚实，以碎求整更深然。</p></c>"
        ],
        "🌳画树|🌳 描绘树木，构建画面生机": [
            "<c><h4>勾勒画树法</h4><p>学习山水先画树，画好枯树是基础。</p><p>枝干得势最重要，精神气质才显露。</p><p>鹿角蟹爪两大类，有疏有密莫齐头。</p><p>多以中锋来勾勒，最忌描摹力无骨。</p><p>熟能生巧需多画，其实枯树并不枯。</p></c>",
            "<c><h4>夹叶树的画法</h4><p>双勾树叶需多练，中锋用笔有断连。</p><p>掌握几种勾叶法，信手写来求自然。</p><p>叶子叠成品字形，根据整体有繁简。</p><p>树冠不可过于大，臃肿之弊不美观。</p><p>墨色干后再着色，色不碍墨往里境。</p></c>",
            "<c><h4>夹叶树的画法</h4><p>双勾树叶需多练，中锋用笔有断连。</p><p>掌握几种勾叶法，信手写来求自然。</p><p>叶子叠成品字形，根据整体有繁简。</p><p>树冠不可过于大，臃肿之弊不美观。</p><p>墨色干后再着色，色不碍墨往里塌。</p></c>"
        ],
        "🖼️构图|🖼️ 巧妙构图，营造和谐画面": [
            "<c><p>画面布设，犹如老秤。</p><p>物大砣小，变中求平。</p><p>平中有变，浓淡重轻。</p><p>稀密得当，切忌平行。</p></c>",
            "<c><p>置陈布势，不宜对称。</p><p>疏可走马，密不透风。</p><p>大千世界，草木葱葱。</p><p>取舍之准，变化为赢。</p></c>",
            "<c><p>移花接木，东讨西征。</p><p>搜妙创員，去粗取精。</p><p>整体入手，骨架相撑。</p><p>白纸一幅，墨种笔耕。</p></c>",
            "<c><p>先定主位，后请亲盟。</p><p>先画整体，在点零星。</p><p>画中有诗，诗中有景。</p><p>景靠笔墨，画出感情。</p></c>",
            "<c><p>取势导向，气贯毫中。</p><p>意到笔随，气脉相通。</p><p>变异奇险，眼活心灵。</p><p>迂回曲折，互为对鸣。</p></c>",
            "<c><p>意神情气，有始有终。</p><p>品评成作，还有余兴。</p><p>画贵开合，收放呼应。</p><p>内外关联，主次分明。</p></c>",
            "<c><p>动静互衬，虚实相生。</p><p>矛盾统一，差距平衡。</p></c>"
        ],
		
		"🖌️技法术语|🖌️ 掌握国画技法，提升绘画能力": [
            "<c><p><h4>没骨</h4>中国画技法名。用彩色直接绘出形象而不用墨色线条勾描的画法。所谓没骨法是不用笔墨钩勒，以重色青绿朱粉适宜染晕。由印度的染晕法脱画而来，跟当时随佛教传入中国的佛像画有关。五代后蜀黄筌画花钩勒较细，着色后几乎不见笔迹，因有“没骨花枝”之称。</p></c>",
            "<c><p><h4>单线平涂</h4>中国画技法名。即轮廓钩线，色彩平涂。若敷施花青色于衣服则全用花青，亦不分浓淡，敷施其他颜色亦然。其特点为单纯明，富有装饰性，所画对象的立体感，主要依靠结构与用笔的变化。民间年画多采用之。</p></c>",
            "<c><p><h4>渲染</h4>中国画技法的一种。以水墨或淡彩涂染画面，以烘染物像，增强艺术效果。</p></c>",
            "<c><p>墨分五色</h4>中国画技法名。指以水调节墨色多层次的浓淡干湿。语出唐代张彦远《历代名画记》：“运墨而五色具。”“五色”说法不一，或指焦、浓、重、淡、清；或指浓、淡、干、湿、黑；也有加“白”，合称“六彩”的。实际乃指墨色运用上的丰富变化。</p></c>",
            "<c><p><h4>宿墨</h4>中国画技法名。初见于北宋郭熙《林泉高致》，有“用墨七法”之说。宿墨是七法之一。指砚中隔宿之墨，当宿墨开始脱胶之际，既而又浓黑，含水旁渖（漫漶)，笔痕犹存，自有一种烟雨細編之气。</p></c>",
            "<c><p><h4>渍水</h4>中国画水法的一种。笔端含水，落笔纸上，全笔头稍作逗留，就留下水渍痕，有漶漫、渗透、用笔多变的韵味。为水法中的重要技法。</p></c>",
            "<c><p><h4>铺水</h4>中国画水法的一种。作画在全局笔墨将完成，大体已干之际，再在画面的需要处敷铺上一层清水，目的在于使整幅的笔墨趋向统一、和谐。</p></c>",
            "<c><p><h4>落墨</h4>即用墨笔把花卉的全部连钩带染地同时，然后略加颜色，使枝、叶、蕊、萼，既有生态，又有立体感。</p></c>",
            "<c><p><h4>积墨</h4>中国画技法名。积墨，即层层加墨。指山水画用墨由淡而浓、逐渐渍染的方法。这种墨法一般由淡开始，待第一次墨迹稍干，再画第二次第三次，可以反复皴擦点染许多次，甚至上了颜色后还可再皴、再勾、画足为止，使物象具有苍辣厚重的立体感与质感。</p></c>",
            "<c><p><h4>点簇</h4>中国画技法名。用笔作点画而簇聚成物象的画法。后多指不用钩勒的点笔花卉画法，又称点垛。在江南地区，对随意挥洒作画，俗称“点点簇簇”。</p></c>",
            "<c><p><h4>点苔</h4>中国画技法名。用毛笔作出直、横、圆、尖或破笔（笔毛散开，无一定形式）或如“介”、“个”等字的点子，表现山石、地坡、枝干上和树根旁的苔藓杂草，以及峰峦上的远树等，在山水画构图经营中广为应用。</p></c>",
            "<c><p><h4>勾勒</h4>指用线条画出轮廓。勾勒是中国技法的名称之一。用笔顺势为“勾”，用笔逆势为“勒”。一般指用线条勾描物象轮廓，不分顺逆，也称“双勾”。主要用于国画。勾勒——又称“单线平涂”。用笔先勾出物象边线，中间用墨或色平涂。多画工笔花鸟。</p></c>",
            "<c><p><h4>双钩</h4>用线条钩描物象的轮廓，通称“钩勒”，因基本上是用左右或上下两笔钩描合拢，故亦称“双钩”。大部用于工笔花鸟画。又旧时摹揭法书。沿字的笔迹两边用细劲的墨线钩出轮廓，也叫“双钩”；双钩后填墨的称为“双钩廓填”。</p></c>",
            "<c><p><h4>湿笔</h4>湿笔与“干笔”对称。属中国画技法名。指笔含较多水份。湿笔作画，兴于唐代张璪。湿笔和干笔（“渴笔”）效果不同，湿笔为浓墨，干笔为焦墨，同样是淡墨，湿笔和干笔也会出不同的趣味。墨的浓淡变化关键在于用水。只有熟练掌握不同程度水分在生宣纸上的渗化效果，才谈得上用水墨塑造人物或景的形象。</p></c>",
            "<c><p><h4>干笔</h4>干笔亦称“渴笔”。与“湿笔”对称，中国画技法名。指笔含较少水份。</p></c>",
            "<c><p><h4>颤笔</h4>颤笔，是书法术语之一，又称“战笔”，指颤动着行笔，以取得线条道劲的效果，是中国画技法之一。</p></c>",
            "<c><p><h4>皴法</h4>中国画技法名。是表现山石、峰峦和树身表皮的脉络纹理的画法。画时先勾出轮廓，再用淡干墨侧笔而画。表现山石、峰峦的，主要有披麻皴、雨点皴、卷云皴、解索皴、牛毛皴、大斧劈皴、小斧劈皴等；表现树身表皮的，有鳞皴、绳皴、横皴、锤头皴等。</p></c>",
            "<c><p><h4>钩斫</h4>山水画技法名。画山石先钩出轮廓外形，谓之“钩”，又用头重尾轻、形如斧斫的皴笔（如斧劈皴、钉头皴等），画出山石的纹路以表现明暗凹凸，谓之“斫”。具体作画未必先钩后斫，也有钩斫掺杂而用，根据各人作画习惯和风格而定。</p></c>",
            "<c><p><h4>金错刀</h4>指在绘制过程中用笔颤抖拖拽形成的一种笔法，写字、绘画的一种笔体。别名金错书。</p></c>"
        ],
        "🖼️构图术语|🖼️ 合理构图布局，营造和谐画面": [
            "<c><p><h4>起结</h4>中国画术语。指绘画构图时起手要宽以起势，紧以归结，有全局观点，不局限于一角，务得通盘贯气的局势。一结如万流归海，收得尽，而又有尽而不尽之意。</p></c>",
            "<c><p><h4>位置</h4>中国画术语。所谓“经营位置”，即指绘画构图布局中要配置适宜，匠心独运。清代王昱《东庄论画》谓：“作画先定位置。何谓位置？阴阳、向背、纵横、起伏、开合、锁结、回抱、勾托、过接、映带，须跌宕欹侧，舒卷自如。</p></c>",
            "<c><p><h4>绘宗十二忌</h4>谓山水画的十二忌病。元代饶自然在《山水家法》提出此说：一、布置迫塞；二、远近不分；三、山无气脉；四、水无源流；五、境无夷险；六、路无出入；七、石止一面；八。树少四枝；九、人物伛偻；十、楼阁错杂；十一、滃淡失宜；十二、点染无法。山水画中布置楼阁，错杂曲折，反可顾盼生姿，饶氏以为忌者，乃指以界画楼阁为主的画材而言。</p></c>"
        ],
        "🎨创作术语|🎨 明确创作理念，提升作品内涵": [
            "<c><p><h4>粉本</h4>中国古代绘画施粉上样的稿本。唐代吴道子曾于大同殿画嘉陵江三百余里山水，一日而毕。玄宗问其状，奏曰：“臣无粉本，并记在心。”元代夏文彦《图绘宝鉴》：“古人画稿谓之粉本。”其法有二：一是用针按画稿墨线密刺小孔，把粉扑入纸、绢或壁上，然后依粉点作画。二是在画稿反面涂以白垩、土粉之类，用簪钗按正面墨线描传于纸、绢或壁上，然后依粉痕落墨。后引伸为对一般画稿的称谓。</p></c>",
            "<c><p><h4>立意</h4>中国画术语。指画家对客观事物反复观察而获得丰富的主题思想。唐代王维说：“凡画山水，意在笔先。”张彦远也说：“意在笔先，画尽意在。”“骨气形似，皆本于立意。”立意有高低深浅之分。清代王原祁说：“如命意不高，眼光不到，虽渲染周致，终属隔膜。”</p></c>",
            "<c><p><h4>迁想妙得</h4>中国画术语。东晋顾恺之《魏晋胜流画赞》：“凡画，人最难，次山水，次狗马，台榭一定器耳，难成而易好，不待迁想妙得也。”此与西晋陆机《文赋》中所谓“浮藻联翩”含意相若。但“迁想”比之“联想”更广泛，更有目的性，画家的“想象力”出于“迁想”，也是画家“神思”的基础。故历来论中国画学的“气韵生动”，赖“迁想妙得”有以致之。</p></c>",
            "<c><p><h4>胸有成竹</h4>中国画术语。北宋文同（字与可）主张画竹必先“胸有成竹”。苏轼在《文与可画筼筜谷偃竹记》中说：“画竹，必先得成竹于胸中”，自称系“与可之教予如此。”又在《书晁补之所藏与可竹三首》诗中，赞曰：“与可画竹时，见竹不见人。岂独不见人，嗒然遗其身。其身与竹化，无穷出清新。”晁补之在《赠文潜甥杨克一学文与可画竹求诗》中，也有“与可画竹时，胸中有成竹”之句。所谓“胸有成竹”，乃言画家创稿之前，对形象塑造、构图布局已有成熟的构思，故能“一发而得其妙解”。</p></c>",
            "<c><p><h4>惜墨如金</h4>中国画术语。意即用墨要恰如其分，不可任意挥霍，尽可能做到用墨不多而表现丰富。相传北宋山水画家李成“惜墨如金”，所画寒林，以渴笔画枯，树身只以淡墨拖抹，但在画面上，仍然获得“山林薮泽、平远险易”的效果。清代吴历曾说：“泼墨、惜墨，画家用墨之微妙，泼者气磅礴，惜者骨疏秀。”钱杜说：“云林（倪瓒）惜墨如金，盖用笔轻而松，燥锋多，润笔少，以皴擦胜渲染耳。夫渲染可以救枯瘠，生云烟，迂翁又何尝顷刻离是法哉！特不肯用湿笔重墨耳。”（《松壶画忆》）都阐述了“惜墨如金”的含义和作用。</p></c>",
            "<c><p><h4>意到笔不到</h4>中国画术语。指画贵含蓄，笔虽未到，却能在意境中得之。唐代张彦远论吴道子画：“意在笔先，画尽意在，虽笔不周而意周也。”北宋苏轼跋赵云子画：“笔略到而意已俱。”清代恽寿平说：“今人用心在有笔墨处，古人用心在无笔墨处，倘能于笔墨不到处观古人用心，庶几拟议神明，进乎技已。”意与笔的关系即虚与实的关系，用笔实处见虚，虚处见实，乃臻“通体皆灵”之妙。</p></c>"
        ],
        "📚其它术语|📚 了解评价标准，赏析国画作品": [
            "<c><p><h4>三绝</h4>中国书画术语，有两说：一是诗、书、画三者都有很高成就称为“三绝”。唐玄宗李隆基曾题字于郑虔的山水画上曰“郑虔三绝”。二是在画史上，东晋顾恺之被称为“三绝”，《晋书》顾恺之本传，称顾具有“才绝、画绝、痴绝”。明清间，也有把“才绝、画绝、书绝”称为“三绝”的。</p></c>",
            "<c><p><h4>三病</h4>谓国画用笔中的三失：版、刻、结。宋 郭若虚 《图画见闻志·论用笔得失》：“画有三病，皆系用笔。所谓三者，一曰版，二曰刻，三曰结。</p></c>"
        ]
    }
};